app/controllers/recipes_controller.rb

SELECT * FROM "recipes" WHERE ("recipes"."id" = '--- :id
---
  def show
    @recipe = Recipe.find(params[:id])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
UPDATE "recipes" SET "updated_at" = '2011-12-15 14:31:41', "method" = 'Fry bacon, butter bread, eat.' WHERE "id" = 1
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.save

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-12-08 15:50:59', 'Cheese on toast', 'Toast bread then grate cheese on top and grill.', '2011-12-08 15:50:59')
---
  def create
    @recipe = Recipe.create(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 3)
DELETE FROM "recipes" WHERE ("id" IN (3))
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.delete