app/controllers/votes_controller.rb

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @recipe.votes.create
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
INSERT INTO "votes" ("created_at", "recipe_id", "updated_at") VALUES('2012-02-09 15:21:38', 1, '2012-02-09 15:21:38')